In [100]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [101]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [102]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [103]:
target = df.Survived
inputs = df.drop(['Survived'],axis='columns')

In [104]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [105]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [106]:
inputs.drop(['Sex'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [107]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [108]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [109]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [110]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [111]:
len(X_train)

712

In [112]:
len(X_test)

179

In [113]:
len(inputs)

891

In [114]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [115]:
model.fit(X_train,y_train)

GaussianNB()

In [116]:
model.score(X_test,y_test)

0.8212290502793296

In [117]:
X_test[:10]

     Pclass        Age     Fare  female  male
89        3  24.000000   8.0500       0     1
722       2  34.000000  13.0000       0     1
53        2  29.000000  26.0000       1     0
890       3  32.000000   7.7500       0     1
857       1  51.000000  26.5500       0     1
411       3  29.699118   6.8583       0     1
76        3  29.699118   7.8958       0     1
449       1  52.000000  30.5000       0     1
360       3  40.000000  27.9000       0     1
314       2  43.000000  26.2500       0     1

In [118]:
y_test[:10]

89     0
722    0
53     1
890    0
857    1
411    0
76     0
449    1
360    0
314    0
Name: Survived, dtype: int64

In [119]:
model.predict(X_test[0:10])

array([0, 0, 1, 0, 0, 0, 0, 0, 0, 0], dtype=int64)

In [120]:
model.predict_proba(X_test[:10])

array([[0.98688205, 0.01311795],
       [0.97505864, 0.02494136],
       [0.03255654, 0.96744346],
       [0.98804859, 0.01195141],
       [0.90678692, 0.09321308],
       [0.98772657, 0.01227343],
       [0.98779349, 0.01220651],
       [0.90270013, 0.09729987],
       [0.98800739, 0.01199261],
       [0.97460639, 0.02539361]])